import BlogBox from "./BlogBox"
import Title from "./Title"




export default function TapsiBlogs() {

    return (
        <>
            <div className="px-32 mt-32 flex gap-8 flex-col sm:p-0">
                <Title title="تازه ترین وبلاگ های تپسی" />
                <div className="grid grid-cols-3 gap-8 sm:grid-cols-1 sm:gap-4 md:grid-cols-1 xl:grid-cols-2">
                    <BlogBox img="/school.jpg" title=" تپسی با سرویس مدرسه آمد."
                        des=" با نزدیک شدن به مهرماه و شروع سال تحصیلی یکی از دغدغه‌های والدین پیدا کردن یک سرویس مدرسه خوب برای فرزندانشان است.
                    اگر فرزند دانش‌آموز دارید، دیگر نیاز نیست به این دغدغه فکر کنید؛ امسال سرویس مدرسه تپسی در
                     کنار شماست تا هیچ گونه نگرانی برای رفت و آمد دانش‌آموزان نداشته باشید. سرویس مدرسه تپسی "/>

                    <BlogBox img="/waite.jpg" title="عجله ندارم ارزانتر سفر میکنم."
                        des="با استفاده از قابلیت جدید تپسی (عجله ندارم) می‌توانید با کمی انتظار بیشتر برای رسیدن سفیر به مبدا خود، با 
                    هزینه‌ کمتر سفر کنید. قابلیت جدید تپسی چگونه کار می‌کند؟
                     در این قابلیت، شما پس از انتخاب مبدا و مقصد خود سه گزینه در ارتباط با سفر خود‌ خواهید دید: توجه داشته باشید که این "/>

                    <BlogBox img="/saghf.jpg" title="سقف خسارت بدون کروکی بیمه بدنه در سال 1402"
                        des="کروکی کشیدن یکی از اموری است که هر راننده‌ای باید با آن آشنا باشد. کروکی کشیدن از آن دسته مهارت‌هایی است که هر راننده‌ای باید
                     در هنگام تصادف در مورد آن بداند تا هر آن‌چه در زمان وقوع حادثه رخ داده را مکتوب و مستند کند. ساده‌تر که بگوییم، کروکی کشیدن به معنای مشخص کردن […]"/>
                </div>
            </div>
        </>
    )
}